/** 时间单位 */
export const Time_unit = {
  毫秒: 0.001,
  秒: 1,
  S: 1,
  SECOND: 1,
  分: 60,
  分钟: 60,
  M: 60,
  MIN: 60,
  MINUTE: 60,
  时: 3600,
  小时: 3600,
  H: 3600,
  HOUR: 3600,
  天: 86400,
  日: 86400,
  D: 86400,
  DAY: 86400,
  周: 604800,
  W: 604800,
  WEEK: 604800,
  月: 2592000,
  MONTH: 2592000,
  年: 31536000,
  Y: 31536000,
  YEAR: 31536000

}

/** 在线状态 */
export const status = {
  31: '离开',
  50: '忙碌',
  70: '请勿打扰',
  41: '隐身',
  11: '我在线上',
  60: 'Q我吧'
}

/** 权限 */
export const ROLE_MAP = {
  admin: '群管理',
  owner: '群主',
  member: '群员'
}
